app/views/posts/index.html.erb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
---
<h1>Believe It Or Not I'm Blogging On Air</h1>
<% if !params[:author].blank? %>
  <% @posts = Post.where(author: params[:author]) %>